#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```hcl
[command]/home/runner/work/_temp/b689abc2-c335-464f-b320-8a7db6273635/terraform-bin show -no-color tfplan.out

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            [web_servers]
            3.239.24.35 ansible_user=ubuntu ansible_ssh_private_key_file=./hello.pem
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "inventory.ini"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.ansible_inventory will be created%0A  + resource "local_file" "ansible_inventory" {%0A      + content              = <<-EOT%0A            [web_servers]%0D%0A            3.239.24.35 ansible_user=ubuntu ansible_ssh_private_key_file=./hello.pem%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "inventory.ini"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

#### New Infracost Breakdown 💰
<details><summary>Show Breakdown</summary>

```sh
Project: main

 Name                                                       Monthly Qty  Unit                  Monthly Cost   
                                                                                                              
 aws_instance.ec2                                                                                             
 ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)               730  hours                       $30.37   
 └─ root_block_device                                                                                         
    └─ Storage (general purpose SSD, gp2)                             8  GB                           $0.80   
                                                                                                              
 aws_instance.ec2-2                                                                                           
 ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)               730  hours                       $30.37   
 └─ root_block_device                                                                                         
    └─ Storage (general purpose SSD, gp2)                             8  GB                           $0.80   
                                                                                                              
 aws_route53_record.db_record                                                                                 
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.frontend_record                                                                           
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.traefik_record                                                                            
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.www_db_record                                                                             
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.www_frontend_record                                                                       
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.www_traefik_record                                                                        
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 OVERALL TOTAL                                                                                      $62.34 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
14 cloud resources were detected:
∙ 8 were estimated
∙ 6 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $62 ┃           - ┃        $62 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```

</details>

*Pushed by: @DrInTech22, Action: `pull_request`*